spec/fixtures/authentication_token_get_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <AuthenticationTokenGet xmlns="http://rex11.com/webmethods/">
      <WebAddress>sync.rex11.com</WebAddress>
      <UserName>the_username</UserName>
      <Password>the_password</Password>
    </AuthenticationTokenGet>
  </soap:Body>
</soap:Envelope>